Repository: airtihat/taskmanager
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: إدارة.
ar: Team Administration.

source: الرسائل
ar: Messages

source: خرائط الموقع
ar: Sitemaps

source: الملفات الثابتة
ar: Static Files

source: التلقيم
ar: Syndication

source: رقم الصفحة يجب أن يكون رقماً صحيحاً
ar: Page number must be an integer

source: رقم الصفحة يجب أن يكون أكبر من أو يساوي 1
ar: Page number must be greater than or equal to 1

source: هذه الصفحة لا تحتوي على نتائج
ar: This page contains no results

source: أدخل قيمة صالحة.
ar: Enter a valid value.

source: أدخل اسم نطاق صالح.
ar: Enter a valid domain name.

source: أدخل رابط URL صالح.
ar: Enter a valid URL.

source: أدخل عدداً صحيحاً صالحاً.
ar: Enter a valid integer.

source: أدخل عنوان بريد إلكتروني صالح.
ar: Enter a valid email address.

source: أدخل slug صالحاً يتكون من حروف وأرقام وشرطات سفلية أو شرطات.
ar: Enter a valid slug consisting of letters, numbers, underscores or hyphens.

source: أدخل slug صالحاً يتكون من حروف يونيكود وأرقام وشرطات سفلية أو شرطات.
ar: Enter a valid slug consisting of Unicode letters, numbers, underscores, or hyphens.

source: أدخل عنوان %(protocol)s صالح.
ar: Enter a valid %(protocol)s address.

source: IPv4 أو IPv6
ar: IPv4 or IPv6

source: أدخل أرقاماً فقط مفصولة بفواصل.
ar: Enter only digits separated by commas.

source: تأكد أن هذه القيمة هي %(limit_value)s (القيمة الحالية هي %(show_value)s).
ar: Ensure this value is %(limit_value)s (it is %(show_value)s).

source: تأكد أن هذه القيمة أقل من أو تساوي %(limit_value)s.
ar: Ensure this value is less than or equal to %(limit_value)s.

source: تأكد أن هذه القيمة أكبر من أو تساوي %(limit_value)s.
ar: Ensure this value is greater than or equal to %(limit_value)s.

source: تأكد أن هذه القيمة من مضاعفات حجم الخطوة %(limit_value)s.
ar: Ensure this value is a multiple of step size %(limit_value)s.

source: تأكد أن هذه القيمة من مضاعفات حجم الخطوة %(limit_value)s، بدءاً من %(offset)s، مثل %(offset)s، %(valid_value1)s، %(valid_value2)s، وهكذا.
ar: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.

source: تأكد أن هذه القيمة تحتوي على حرف واحد على الأقل (تحتوي حالياً على %(show_value)d).
ar: Ensure this value contains at least one character (it has %(show_value)d).

source: تأكد أن هذه القيمة تحتوي على %(limit_value)d أحرف على الأقل (تحتوي حالياً على %(show_value)d).
ar: Ensure this value contains at least %(limit_value)d characters (it has %(show_value)d).

source: تأكد أن هذه القيمة تحتوي على حرف واحد كحد أقصى (تحتوي حالياً على %(show_value)d).
ar: Ensure this value contains at most one character (it has %(show_value)d).

source: تأكد أن هذه القيمة تحتوي على %(limit_value)d أحرف كحد أقصى (تحتوي حالياً على %(show_value)d).
ar: Ensure this value contains at most %(limit_value)d characters (it has %(show_value)d).

source: أدخل رقماً.
ar: Enter a number.

source: تأكد أن العدد الإجمالي للأرقام لا يتجاوز %(max)s.
ar: Ensure that there are no more than %(max)s digits in total.

source: تأكد أن عدد المنازل العشرية لا يتجاوز %(max)s.
ar: Ensure that there are no more than %(max)s decimal places.

source: تأكد أن عدد الأرقام قبل الفاصلة العشرية لا يتجاوز %(max)s.
ar: Ensure that there are no more than %(max)s digits before the decimal point.

source: امتداد الملف %(extension)s غير مسموح به. الامتدادات المسموح بها هي: %(allowed_extensions)s.
ar: File extension '%(extension)s' is not allowed. Allowed extensions are: '%(allowed_extensions)s'.

source: الأحرف الفارغة غير مسموح بها.
ar: Blank characters are not allowed.

source: و
ar: and

source: %(model_name)s بهذا %(field_labels)s موجود بالفعل.
ar: %(model_name)s with this %(field_labels)s already exists.

source: تم انتهاك القيد %(name)s.
ar: Constraint '%(name)s' is violated.

source: القيمة %(value)r ليست خياراً صالحاً.
ar: Value %(value)r is not a valid choice.

source: هذا الحقل لا يمكن أن يكون فارغاً.
ar: This field cannot be null.

source: %(model_name)s بهذا %(field_label)s موجود بالفعل.
ar: %(model_name)s with this %(field_label)s already exists.

source: حقل من النوع: %(field_type)s
ar: Field of type: %(field_type)s

source: %(value)s قيمة يجب أن تكون إما True أو False.
ar: %(value)s must be either True or False.

source: %(value)s يجب أن تكون إما True أو False أو None.
ar: %(value)s must be either True, False, or None.

source: منطقي (إما True أو False)
ar: Boolean (Either True or False)

source: سلسلة نصية (حتى %(max_length)s)
ar: String (up to %(max_length)s)

source: سلسلة نصية (غير محدودة)
ar: String (unlimited)

source: أعداد صحيحة مفصولة بفواصل
ar: Comma-separated integers

source: %(value)s قيمة لها تنسيق تاريخ غير صالح. يجب أن تكون بتنسيق YYYY-MM-DD.
ar: %(value)s has an invalid date format. It must be in YYYY-MM-DD format.

source: %(value)s لها التنسيق الصحيح (YYYY-MM-DD) ولكنها تاريخ غير صالح.
ar: %(value)s has the correct format (YYYY-MM-DD) but it is an invalid date.

source: تاريخ (بدون وقت)
ar: Date (without time)

source: %(value)s لها تنسيق غير صالح. يجب أن تكون بتنسيق YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ].
ar: %(value)s has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.

source: %(value)s لها التنسيق الصحيح (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) ولكنها تاريخ/وقت غير صالح.
ar: %(value)s has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.

source: تاريخ (مع وقت)
ar: Date (with time)

source: %(value)s يجب أن تكون رقم عشري.
ar: %(value)s must be a decimal number.

source: رقم عشري
ar: Decimal number

source: %(value)s لها تنسيق غير صالح. يجب أن تكون بتنسيق [DD] [[HH:]MM:]ss[.uuuuuu].
ar: %(value)s has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.

source: المدة
ar: Duration

source: عنوان البريد الإلكتروني
ar: Email address

source: مسار الملف
ar: File path

source: %(value)s يجب أن تكون عدداً عشرياً.
ar: %(value)s must be a float.

source: %(value)s يجب أن تكون عدداً صحيحاً.
ar: %(value)s must be an integer.

source: عدد صحيح
ar: Integer

source: عدد صحيح كبير (8 بايت)
ar: Big integer (8 bytes)

source: عدد صحيح صغير
ar: Small integer

source: عنوان IPv4
ar: IPv4 address

source: عنوان IP
ar: IP address

source: %(value)s يجب أن تكون إما None أو True أو False.
ar: %(value)s must be either None, True, or False.

source: منطقي (إما True أو False أو None)
ar: Boolean (Either True, False, or None)

source: عدد صحيح موجب كبير
ar: Positive big integer

source: عدد صحيح موجب
ar: Positive integer

source: عدد صحيح موجب صغير
ar: Positive small integer

source: Slug (حتى %(max_length)s)
ar: Slug (up to %(max_length)s)

source: نص
ar: Text

source: %(value)s لها تنسيق غير صالح. يجب أن تكون بتنسيق HH:MM[:ss[.uuuuuu
ar: %(value)s has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
